a = '''
189, 나인트리 호텔 동대문
192, 헨나호텔서울명동
194, 2U호스텔
207, 96번지
211, 서울호스텔
215, 나인트리 프리미어호텔 명동2
218, 리플러스 호스텔
220, 사보이호텔
229, 프레이저플레이스남대문
232, 호텔신라
234, 크리에이터 타운 소공
238, 나인트리호텔 명동
239, 뉴서울호텔
241, (주)서울렉스호텔
242, 체이슨 엠(CHASON M)
245, 맹그로브 동대문
247, 해밀톤관광호텔
248, 가야라트리호텔
256, 와이호텔
271, 벨라지오 관광호텔
272, 영호스텔
273, 호텔루 136
279, 궁전호스텔
280, 스위스그랜드호텔서울
282, 24게스트하우스 신촌에비뉴엘점
302, 클레오
306, 호텔에스
310, 제이케이블라썸호텔
311, 호텔 엠펠리체
320, (주)컴앤스테이 강서
326, 구로 제이에스 호스텔
327, 스토리호스텔
328, 바모스하우스
331, 마인드 관광호텔
332, 스텔라이
339, 이도
346, 호텔 지엠에스[HOTEL GMS]
347, 셀립 여의
348, 여울
352, 씨엘 관광호텔
354, 따담
355, 노바루스관광호텔
361, 더 리베라
362, 글래드호텔앤리조트(주) 글래드 여의도
369, 팰리스
375, 그랑블루
377, (주)CS프리미어호텔서울
378, 더케이호텔앤리조트(주) 더케이호텔서울
381, 유원관광호텔
382, 호텔 소설(小雪)
387, JW메리어트호텔 서울
391, 안다즈 서울 강남
397, 베니키아 강남 노블레스 호텔
413, 호텔 컬리넌 역삼
415, 그랜드인터컨티넨탈 서울 파르나스
421, 뉴삼화호텔
423, 에이든 청담호텔
437, 가락관광호텔
'''
for i in a.split(','):
    print(i)